---
type: SchedulableField
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# SchedulableField

`Autodesk.Revit.DB.SchedulableField` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SchedulableField | — | `` |
| Constructor | SchedulableField | 2013 | `public SchedulableField ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Method | GetCustomFieldData | 2024 | `public CustomFieldData GetCustomFieldData ()` |
| Method | GetHashCode | — | `public override int GetHashCode ()` |
| Method | GetName | 2013 | `public string GetName ( Document document )` |
| Property | FieldType | 2013 | `public ScheduleFieldType FieldType { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ParameterId | 2013 | `public ElementId ParameterId { get ; set ; }` |